# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
s1 = pd.Series(np.random.randint(1,5,100))

In [3]:
s2 = pd.Series(np.random.randint(1,4,100))

In [4]:
s3 = pd.Series(np.random.randint(10000,30001,100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [5]:
df = pd.concat([s1,s2,s3],axis=1)
df

    0  1      2
0   2  1  15471
1   4  1  18408
2   3  3  13906
3   3  3  10887
4   1  1  12802
.. .. ..    ...
95  2  3  14225
96  2  1  27898
97  1  3  25921
98  2  3  25167
99  1  1  22751

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [6]:
df.columns = ['bedrs','bathrs','price_sqr_meter']
df

    bedrs  bathrs  price_sqr_meter
0       2       1            15471
1       4       1            18408
2       3       3            13906
3       3       3            10887
4       1       1            12802
..    ...     ...              ...
95      2       3            14225
96      2       1            27898
97      1       3            25921
98      2       3            25167
99      1       1            22751

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [7]:
bigcolumn = pd.concat([s1,s2,s3],axis=0)

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [10]:
bigcolumn = bigcolumn.to_frame()

In [11]:
bigcolumn.tail()

        0
95  14225
96  27898
97  25921
98  25167
99  22751

In [12]:
bigcolumn.shape

(300, 1)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [13]:
bigcolumn.reindex()

        0
0       2
1       4
2       3
3       3
4       1
..    ...
95  14225
96  27898
97  25921
98  25167
99  22751

[300 rows x 1 columns]